#+TITLE:index3 
#+AUTHOR: Ivan Hanigan
#+email: ivan.hanigan@anu.edu.au
#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [a4paper]
#+LATEX: \tableofcontents
-----
*** COMMENT go
#+name:go
#+begin_src R :session *R* :tangle no :exports none :eval yes
#### name:go ####
system("pdflatex swish-dmp-curves.tex")
system("pdflatex swish-dmp-curves.tex")
browseURL("swish-dmp-curves.pdf")
#+end_src

#+RESULTS: go
: 0

*** run-able R
#+begin_src R :session *R* :tangle main.Rmd :exports none :eval yes :padline no
  dir()
  library(rmarkdown)
  library(knitr)
  library(knitcitations)
  library(bibtex)
  cleanbib()
  cite_options(citation_format = "pandoc", check.entries=FALSE) 
  rmarkdown::render("main.Rmd", "pdf_document")
  #browseURL("main.pdf")
  rmarkdown::render("main.Rmd", "html_document")
  #browseURL("main.html")
  # to get the R code only 
  knitr::knit("main.Rmd", tangle=T)
  ```
#+end_src

#+RESULTS:
: /home/ivan_hanigan/tools/disentangle/main.html

